---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarElemHookEndOrient
source: html/1eb90efa-e864-e96c-959e-865e90e94d21.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarElemHookEndOrient Property

"Hook Orientation At End"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarElemHookEndOrient { get; }
```